<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="onnx::Pad_0" type="Parameter" version="opset1">
			<data shape="1,3,256,256" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="onnx::Pad_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="onnx::Conv_1210" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 3, 3" offset="0" size="3456" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1210">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="/layer1/layer1.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Reshape_315" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="3456" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="/layer1/layer1.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layer1/layer1.0/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="/layer1/layer1.2/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/layer1/layer1.2/Clip_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Reshape_354" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 3, 3" offset="3584" size="1152" />
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="/layer1/layer1.3/layer1.3.0/conv_dw/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Reshape_440" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="4736" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/layer1/layer1.3/layer1.3.0/conv_dw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layer1/layer1.3/layer1.3.0/conv_dw/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/layer1/layer1.3/layer1.3.0/act1/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/layer1/layer1.3/layer1.3.0/act1/Clip_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="onnx::Conv_1216" type="Const" version="opset1">
			<data element_type="f32" shape="24, 32, 1, 1" offset="4864" size="3072" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1216">
					<dim>24</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/layer1/layer1.3/layer1.3.0/conv_pw/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Reshape_492" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="7936" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/layer1/layer1.3/layer1.3.0/conv_pw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layer1/layer1.3/layer1.3.0/conv_pw/Conv_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="onnx::Conv_1219" type="Const" version="opset1">
			<data element_type="f32" shape="144, 24, 1, 1" offset="8032" size="13824" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1219">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/layer1/layer1.4/layer1.4.0/conv_pw/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Reshape_540" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="21856" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/layer1/layer1.4/layer1.4.0/conv_pw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layer1/layer1.4/layer1.4.0/conv_pw/Conv_output_0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/layer1/layer1.4/layer1.4.0/act1/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/layer1/layer1.4/layer1.4.0/act1/Clip_output_0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/layer1/layer1.4/layer1.4.0/conv_dw/Shape_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Shape_1_output_0,/layer1/layer1.4/layer1.4.0/conv_dw/Shape_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="22432" size="8" />
			<output>
				<port id="0" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="22" name="Constant_578" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="22440" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="23" name="/layer1/layer1.4/layer1.4.0/conv_dw/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="24" name="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="22448" size="8" />
			<output>
				<port id="0" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_7_output_0" />
			</output>
		</layer>
		<layer id="25" name="/layer1/layer1.4/layer1.4.0/conv_dw/Div_1" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Cast_2_output_0,/layer1/layer1.4/layer1.4.0/conv_dw/Cast_3_output_0,/layer1/layer1.4/layer1.4.0/conv_dw/Div_1_output_0" />
			</output>
		</layer>
		<layer id="26" name="Constant_48358" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="22456" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="27" name="/layer1/layer1.4/layer1.4.0/conv_dw/Neg_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Neg_1_output_0" />
			</output>
		</layer>
		<layer id="28" name="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="22464" size="8" />
			<output>
				<port id="0" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_8_output_0" />
			</output>
		</layer>
		<layer id="29" name="/layer1/layer1.4/layer1.4.0/conv_dw/Sub_2" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Sub_2_output_0" />
			</output>
		</layer>
		<layer id="30" name="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_9" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="22472" size="8" />
			<output>
				<port id="0" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_9_output_0" />
			</output>
		</layer>
		<layer id="31" name="/layer1/layer1.4/layer1.4.0/conv_dw/Mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Mul_1_output_0" />
			</output>
		</layer>
		<layer id="32" name="Constant_48375" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="22432" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="33" name="/layer1/layer1.4/layer1.4.0/conv_dw/Add_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Add_3_output_0" />
			</output>
		</layer>
		<layer id="34" name="/layer1/layer1.4/layer1.4.0/conv_dw/Sub_3" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Sub_3_output_0" />
			</output>
		</layer>
		<layer id="35" name="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_12" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="22472" size="8" />
			<output>
				<port id="0" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_12_output_0" />
			</output>
		</layer>
		<layer id="36" name="/layer1/layer1.4/layer1.4.0/conv_dw/Div_2" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Cast_4_output_0,/layer1/layer1.4/layer1.4.0/conv_dw/Cast_5_output_0,/layer1/layer1.4/layer1.4.0/conv_dw/Div_2_output_0" />
			</output>
		</layer>
		<layer id="37" name="Constant_627" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="22440" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/layer1/layer1.4/layer1.4.0/conv_dw/Unsqueeze_4" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Unsqueeze_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/layer1/layer1.4/layer1.4.0/conv_dw/Sub_4" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Sub_4_output_0" />
			</output>
		</layer>
		<layer id="40" name="Constant_629" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="22440" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/layer1/layer1.4/layer1.4.0/conv_dw/Unsqueeze_5" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Unsqueeze_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/layer1/layer1.4/layer1.4.0/conv_dw/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="22472" size="8" />
			<output>
				<port id="0" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_output_0" />
			</output>
		</layer>
		<layer id="43" name="Constant_574" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="22440" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="44" name="/layer1/layer1.4/layer1.4.0/conv_dw/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Gather_output_0" />
			</output>
		</layer>
		<layer id="45" name="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="22448" size="8" />
			<output>
				<port id="0" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="46" name="/layer1/layer1.4/layer1.4.0/conv_dw/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Cast_1_output_0,/layer1/layer1.4/layer1.4.0/conv_dw/Cast_output_0,/layer1/layer1.4/layer1.4.0/conv_dw/Div_output_0" />
			</output>
		</layer>
		<layer id="47" name="Constant_48360" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="22456" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="48" name="/layer1/layer1.4/layer1.4.0/conv_dw/Neg" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Neg_output_0" />
			</output>
		</layer>
		<layer id="49" name="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="22464" size="8" />
			<output>
				<port id="0" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_3_output_0" />
			</output>
		</layer>
		<layer id="50" name="/layer1/layer1.4/layer1.4.0/conv_dw/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Sub_output_0" />
			</output>
		</layer>
		<layer id="51" name="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="22472" size="8" />
			<output>
				<port id="0" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_4_output_0" />
			</output>
		</layer>
		<layer id="52" name="/layer1/layer1.4/layer1.4.0/conv_dw/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Mul_output_0" />
			</output>
		</layer>
		<layer id="53" name="Constant_48378" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="22432" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="54" name="/layer1/layer1.4/layer1.4.0/conv_dw/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Add_1_output_0" />
			</output>
		</layer>
		<layer id="55" name="/layer1/layer1.4/layer1.4.0/conv_dw/Sub_1" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Sub_1_output_0" />
			</output>
		</layer>
		<layer id="56" name="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_13" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="22472" size="8" />
			<output>
				<port id="0" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_13_output_0" />
			</output>
		</layer>
		<layer id="57" name="/layer1/layer1.4/layer1.4.0/conv_dw/Div_3" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Cast_6_output_0,/layer1/layer1.4/layer1.4.0/conv_dw/Cast_7_output_0,/layer1/layer1.4/layer1.4.0/conv_dw/Div_3_output_0" />
			</output>
		</layer>
		<layer id="58" name="Constant_631" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="22440" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/layer1/layer1.4/layer1.4.0/conv_dw/Unsqueeze_6" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Unsqueeze_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/layer1/layer1.4/layer1.4.0/conv_dw/Sub_5" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Sub_5_output_0" />
			</output>
		</layer>
		<layer id="61" name="Constant_633" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="22440" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/layer1/layer1.4/layer1.4.0/conv_dw/Unsqueeze_7" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Unsqueeze_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/layer1/layer1.4/layer1.4.0/conv_dw/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Cast_8_output_0,/layer1/layer1.4/layer1.4.0/conv_dw/Concat_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/layer1/layer1.4/layer1.4.0/conv_dw/ConstantOfShape" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="22480" size="32" />
			<output>
				<port id="0" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/ConstantOfShape_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/layer1/layer1.4/layer1.4.0/conv_dw/Concat_2" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Concat_2_output_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_16" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="22512" size="16" />
			<output>
				<port id="0" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_16_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/layer1/layer1.4/layer1.4.0/conv_dw/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Reshape_output_0">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_18" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="22456" size="8" />
			<output>
				<port id="0" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_18_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_19" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="22528" size="8" />
			<output>
				<port id="0" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_19_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_20" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="22456" size="8" />
			<output>
				<port id="0" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_20_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/layer1/layer1.4/layer1.4.0/conv_dw/Slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Slice_output_0">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_679" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="22536" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/layer1/layer1.4/layer1.4.0/conv_dw/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Transpose_output_0">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_19048" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="22456" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/layer1/layer1.4/layer1.4.0/conv_dw/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/layer1/layer1.4/layer1.4.0/conv_dw/Cast_9_output_0,/layer1/layer1.4/layer1.4.0/conv_dw/Reshape_1_output_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_690" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="22440" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="77" name="Split_691" type="Split" version="opset1">
			<data num_splits="2" />
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_22" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="22552" size="4" />
			<output>
				<port id="0" precision="FP32" names="/layer1/layer1.4/layer1.4.0/conv_dw/Constant_22_output_0" />
			</output>
		</layer>
		<layer id="79" name="/layer1/layer1.4/layer1.4.0/conv_dw/Pad" type="Pad" version="opset1">
			<data pad_mode="constant" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32" />
			</input>
			<output>
				<port id="4" precision="FP32" names="/layer1/layer1.4/layer1.4.0/conv_dw/Pad_output_0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Reshape_1513" type="Const" version="opset1">
			<data element_type="f32" shape="144, 1, 1, 3, 3" offset="22556" size="5184" />
			<output>
				<port id="0" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/layer1/layer1.4/layer1.4.0/conv_dw/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Reshape_1599" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="27740" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/layer1/layer1.4/layer1.4.0/conv_dw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layer1/layer1.4/layer1.4.0/conv_dw/Conv_output_0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/layer1/layer1.4/layer1.4.0/act2/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/layer1/layer1.4/layer1.4.0/act2/Clip_output_0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="onnx::Conv_1225" type="Const" version="opset1">
			<data element_type="f32" shape="32, 144, 1, 1" offset="28316" size="18432" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1225">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/layer1/layer1.4/layer1.4.0/conv_pwl/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Reshape_1651" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="46748" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/layer1/layer1.4/layer1.4.0/conv_pwl/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layer1/layer1.4/layer1.4.0/conv_pwl/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="onnx::Conv_1228" type="Const" version="opset1">
			<data element_type="f32" shape="192, 32, 1, 1" offset="46876" size="24576" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1228">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/layer1/layer1.4/layer1.4.1/conv_pw/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Reshape_1699" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="71452" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/layer1/layer1.4/layer1.4.1/conv_pw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layer1/layer1.4/layer1.4.1/conv_pw/Conv_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/layer1/layer1.4/layer1.4.1/act1/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/layer1/layer1.4/layer1.4.1/act1/Clip_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Reshape_1738" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 3, 3" offset="72220" size="6912" />
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/layer1/layer1.4/layer1.4.1/conv_dw/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Reshape_1824" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="79132" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/layer1/layer1.4/layer1.4.1/conv_dw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layer1/layer1.4/layer1.4.1/conv_dw/Conv_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/layer1/layer1.4/layer1.4.1/act2/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/layer1/layer1.4/layer1.4.1/act2/Clip_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="onnx::Conv_1234" type="Const" version="opset1">
			<data element_type="f32" shape="32, 192, 1, 1" offset="79900" size="24576" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1234">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/layer1/layer1.4/layer1.4.1/conv_pwl/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Reshape_1876" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="104476" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/layer1/layer1.4/layer1.4.1/conv_pwl/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layer1/layer1.4/layer1.4.1/conv_pwl/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/layer1/layer1.4/layer1.4.1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layer1/layer1.4/layer1.4.1/Add_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="onnx::Conv_1237" type="Const" version="opset1">
			<data element_type="f32" shape="192, 32, 1, 1" offset="104604" size="24576" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1237">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="/layer1/layer1.4/layer1.4.2/conv_pw/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Reshape_1925" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="129180" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/layer1/layer1.4/layer1.4.2/conv_pw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layer1/layer1.4/layer1.4.2/conv_pw/Conv_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="/layer1/layer1.4/layer1.4.2/act1/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/layer1/layer1.4/layer1.4.2/act1/Clip_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Reshape_1964" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 3, 3" offset="129948" size="6912" />
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="/layer1/layer1.4/layer1.4.2/conv_dw/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Reshape_2050" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="136860" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="/layer1/layer1.4/layer1.4.2/conv_dw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layer1/layer1.4/layer1.4.2/conv_dw/Conv_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="/layer1/layer1.4/layer1.4.2/act2/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/layer1/layer1.4/layer1.4.2/act2/Clip_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="onnx::Conv_1243" type="Const" version="opset1">
			<data element_type="f32" shape="32, 192, 1, 1" offset="137628" size="24576" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1243">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="/layer1/layer1.4/layer1.4.2/conv_pwl/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Reshape_2102" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="162204" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="/layer1/layer1.4/layer1.4.2/conv_pwl/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layer1/layer1.4/layer1.4.2/conv_pwl/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="/layer1/layer1.4/layer1.4.2/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layer1/layer1.4/layer1.4.2/Add_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="onnx::Conv_1246" type="Const" version="opset1">
			<data element_type="f32" shape="192, 32, 1, 1" offset="162332" size="24576" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1246">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="/layer2/layer2.0/layer2.0.0/conv_pw/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
